Tekla Open API Reference for Tekla Structures 2025
ComponentOptions.BoltEdgeDistanceReferenceEnum Enumeration
 The bolt edge distance reference type.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltEdgeDistanceReferenceEnum
Public Enumeration BoltEdgeDistanceReferenceEnum
Members
Member name | Value | Description
BOLT_DIAMETER | 0 |  Compares the edge distance to the bolt diameter.
HOLE_DIAMETER | 1 |  Compares the edge distance to the hole diameter.
See Also
Reference
Tekla.Structures Namespace